ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/serial_uart_init.c
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

/*
 * Initialization part of serial_uart.c
 */

/*
 * Authors:
 * jflyper - Refactoring, cleanup and made pin-configurable
 * Dominic Clifton - Serial port abstraction, Separation of common STM32 code for cleanflight, various cleanups.
 * Hamasaki/Timecop - Initial baseflight code
*/

#include <stdbool.h>
#include <stdint.h>

#include "platform.h"

#include "build/build_config.h"

#include "common/utils.h"
#include "drivers/inverter.h"
#include "drivers/rcc.h"

#include "drivers/serial.h"
#include "drivers/serial_uart.h"
#include "drivers/serial_uart_impl.h"

static void usartConfigurePinInversion(uartPort_t *uartPort) {
#if !defined(USE_INVERTER) && !defined(STM32F303xC) && !defined(XMC4700_F100x2048)
    UNUSED(uartPort);
#else
    bool inverted = uartPort->port.options & SERIAL_INVERTED;

#ifdef USE_INVERTER
    if (inverted) {
        // Enable hardware inverter if available.
        enableInverter(uartPort->USARTx, true);
    }
#endif

#ifdef STM32F303xC
    uint32_t inversionPins = 0;

    if (uartPort->port.mode & MODE_TX) {
        inversionPins |= USART_InvPin_Tx;
    }
    if (uartPort->port.mode & MODE_RX) {
        inversionPins |= USART_InvPin_Rx;
    }

    USART_InvPinCmd(uartPort->USARTx, inversionPins, inverted ? ENABLE : DISABLE);
#endif

#ifdef XMC4700_F100x2048
    if (inverted){
		if (uartPort->port.mode & MODE_TX) {
			XMC_USIC_CH_SetDataOutputMode((XMC_USIC_CH_t*)uartPort->USARTx, XMC_USIC_CH_DATA_OUTPUT_MODE_INVERTED);
		}
		if (uartPort->port.mode & MODE_RX) {
			XMC_USIC_CH_EnableInputInversion((XMC_USIC_CH_t*)uartPort->USARTx, XMC_USIC_CH_INPUT_DX0);
		}
    }
#endif

#endif
}

void uartReconfigure(uartPort_t *uartPort)
{
#ifdef XMC4700_F100x2048
	XMC_USIC_CH_SetMode((XMC_USIC_CH_t*)uartPort->USARTx, XMC_USIC_CH_OPERATING_MODE_IDLE);

	XMC_UART_CH_CONFIG_t uart_config =
	{
		.baudrate 		= uartPort->port.baudRate,
		.data_bits		= (uartPort->port.options & SERIAL_PARITY_EVEN) ? 9 : 8,
		.frame_length 	= (uartPort->port.options & SERIAL_PARITY_EVEN) ? 9 : 8,
		.stop_bits		= (uartPort->port.options & SERIAL_STOPBITS_2) ? 2 : 1,
		.oversampling	= 16,
		.parity_mode	= XMC_USIC_CH_PARITY_MODE_NONE,
	};
	XMC_UART_CH_Init((XMC_USIC_CH_t*)uartPort->USARTx, &uart_config);
	XMC_USIC_CH_SetInputSource((XMC_USIC_CH_t*)uartPort->USARTx, XMC_USIC_CH_INPUT_DX0, uartPort->source);

	switch((uint32_t)uartPort->USARTx)
	{
		case (uint32_t)USIC0_CH0:
		case (uint32_t)USIC1_CH0:
		case (uint32_t)USIC2_CH0:
			XMC_USIC_CH_TXFIFO_Configure((XMC_USIC_CH_t*)uartPort->USARTx, 0, XMC_USIC_CH_FIFO_SIZE_16WORDS, 1);
			XMC_USIC_CH_RXFIFO_Configure((XMC_USIC_CH_t*)uartPort->USARTx, 16, XMC_USIC_CH_FIFO_SIZE_16WORDS, 0);
		break;
		case (uint32_t)USIC0_CH1:
		case (uint32_t)USIC1_CH1:
		case (uint32_t)USIC2_CH1:
			XMC_USIC_CH_TXFIFO_Configure((XMC_USIC_CH_t*)uartPort->USARTx, 32, XMC_USIC_CH_FIFO_SIZE_16WORDS, 1);
			XMC_USIC_CH_RXFIFO_Configure((XMC_USIC_CH_t*)uartPort->USARTx, 48, XMC_USIC_CH_FIFO_SIZE_16WORDS, 0);
		break;
	}

	usartConfigurePinInversion(uartPort);

	XMC_UART_CH_Start((XMC_USIC_CH_t*)uartPort->USARTx);
#else
    USART_InitTypeDef USART_InitStructure;
    USART_Cmd(uartPort->USARTx, DISABLE);

    USART_InitStructure.USART_BaudRate = uartPort->port.baudRate;

    // according to the stm32 documentation wordlen has to be 9 for parity bits
    // this does not seem to matter for rx but will give bad data on tx!
    // This seems to cause RX to break on STM32F1, see https://github.com/betaflight/betaflight/pull/1654
    if (
#if defined(STM32F1)
            false &&
#endif
            (uartPort->port.options & SERIAL_PARITY_EVEN)) {
        USART_InitStructure.USART_WordLength = USART_WordLength_9b;
    } else {
        USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    }

    USART_InitStructure.USART_StopBits = (uartPort->port.options & SERIAL_STOPBITS_2) ? USART_StopBits_2 : USART_StopBits_1;
    USART_InitStructure.USART_Parity   = (uartPort->port.options & SERIAL_PARITY_EVEN) ? USART_Parity_Even : USART_Parity_No;

    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = 0;
    if (uartPort->port.mode & MODE_RX)
        USART_InitStructure.USART_Mode |= USART_Mode_Rx;
    if (uartPort->port.mode & MODE_TX)
        USART_InitStructure.USART_Mode |= USART_Mode_Tx;

    USART_Init(uartPort->USARTx, &USART_InitStructure);

    usartConfigurePinInversion(uartPort);

    if (uartPort->port.options & SERIAL_BIDIR)
        USART_HalfDuplexCmd(uartPort->USARTx, ENABLE);
    else
        USART_HalfDuplexCmd(uartPort->USARTx, DISABLE);

    USART_Cmd(uartPort->USARTx, ENABLE);
#endif
}

serialPort_t *uartOpen(UARTDevice_e device, serialReceiveCallbackPtr rxCallback, void *rxCallbackData, uint32_t baudRate, portMode_e mode, portOptions_e options)
{
    uartPort_t *s = serialUART(device, baudRate, mode, options);

    if (!s)
        return (serialPort_t *)s;

    s->txDMAEmpty = true;

    // common serial initialisation code should move to serialPort::init()
    s->port.rxBufferHead = s->port.rxBufferTail = 0;
    s->port.txBufferHead = s->port.txBufferTail = 0;
    // callback works for IRQ-based RX ONLY
    s->port.rxCallback = rxCallback;
    s->port.rxCallbackData = rxCallbackData;
    s->port.mode = mode;
    s->port.baudRate = baudRate;
    s->port.options = options;

#ifdef XMC4700_F100x2048
    uartDevice_t *uartDev = uartDevmap[device];
    s->source = uartDev->rxSrc;
#endif

    uartReconfigure(s);

#ifdef XMC4700_F100x2048

    if (mode & MODE_RX)
    {
		 switch(uartDev->hardware->rxIrq)
		 {
			case USIC0_0_IRQn:
			case USIC1_0_IRQn:
			case USIC2_0_IRQn:
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 0);
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE, 0);
				break;
			case USIC0_1_IRQn:
			case USIC1_1_IRQn:
			case USIC2_1_IRQn:
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 1);
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE, 1);
				break;
			case USIC0_2_IRQn:
			case USIC1_2_IRQn:
			case USIC2_2_IRQn:
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 2);
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE, 2);
				break;
			case USIC0_3_IRQn:
			case USIC1_3_IRQn:
			case USIC2_3_IRQn:
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 3);
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE, 3);
				break;
			case USIC0_4_IRQn:
			case USIC1_4_IRQn:
			case USIC2_4_IRQn:
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 4);
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE, 4);
				break;
			case USIC0_5_IRQn:
			case USIC1_5_IRQn:
			case USIC2_5_IRQn:
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 5);
				XMC_USIC_CH_RXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_INTERRUPT_NODE_POINTER_ALTERNATE, 5);
				break;
		 }
		 XMC_USIC_CH_RXFIFO_EnableEvent((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_RXFIFO_EVENT_CONF_STANDARD | XMC_USIC_CH_RXFIFO_EVENT_CONF_ALTERNATE);
     }

     // Transmit DMA or IRQ
     if (mode & MODE_TX)
     {
		 switch(uartDev->hardware->txIrq)
		 {
			case USIC0_0_IRQn:
			case USIC1_0_IRQn:
			case USIC2_0_IRQn:
			 XMC_USIC_CH_TXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 0);
				break;
			case USIC0_1_IRQn:
			case USIC1_1_IRQn:
			case USIC2_1_IRQn:
			 XMC_USIC_CH_TXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 1);
				break;
			case USIC0_2_IRQn:
			case USIC1_2_IRQn:
			case USIC2_2_IRQn:
			 XMC_USIC_CH_TXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 2);
				break;
			case USIC0_3_IRQn:
			case USIC1_3_IRQn:
			case USIC2_3_IRQn:
			 XMC_USIC_CH_TXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 3);
				break;
			case USIC0_4_IRQn:
			case USIC1_4_IRQn:
			case USIC2_4_IRQn:
			 XMC_USIC_CH_TXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 4);
				break;
			case USIC0_5_IRQn:
			case USIC1_5_IRQn:
			case USIC2_5_IRQn:
			 XMC_USIC_CH_TXFIFO_SetInterruptNodePointer((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_INTERRUPT_NODE_POINTER_STANDARD, 5);
				break;
		 }

		 XMC_USIC_CH_TXFIFO_EnableEvent((XMC_USIC_CH_t*)s->USARTx, XMC_USIC_CH_TXFIFO_EVENT_CONF_STANDARD);
	 }

#else
    // Receive DMA or IRQ
    DMA_InitTypeDef DMA_InitStructure;
    if (mode & MODE_RX) {
#ifdef STM32F4
        if (s->rxDMAStream) {
            DMA_StructInit(&DMA_InitStructure);
            DMA_InitStructure.DMA_PeripheralBaseAddr = s->rxDMAPeripheralBaseAddr;
            DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
            DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
            DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
            DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
            DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
            DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable ;
            DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull ;
            DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single ;
            DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
#else
        if (s->rxDMAChannel) {
            DMA_StructInit(&DMA_InitStructure);
            DMA_InitStructure.DMA_PeripheralBaseAddr = s->rxDMAPeripheralBaseAddr;
            DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
            DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
            DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
            DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
            DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
            DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
#endif
            DMA_InitStructure.DMA_BufferSize = s->port.rxBufferSize;

#ifdef STM32F4
            DMA_InitStructure.DMA_Channel = s->rxDMAChannel;
            DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
            DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
            DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)s->port.rxBuffer;
            DMA_DeInit(s->rxDMAStream);
            DMA_Init(s->rxDMAStream, &DMA_InitStructure);
            DMA_Cmd(s->rxDMAStream, ENABLE);
            USART_DMACmd(s->USARTx, USART_DMAReq_Rx, ENABLE);
            s->rxDMAPos = DMA_GetCurrDataCounter(s->rxDMAStream);
#else
            DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
            DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
            DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)s->port.rxBuffer;
            DMA_DeInit(s->rxDMAChannel);
            DMA_Init(s->rxDMAChannel, &DMA_InitStructure);
            DMA_Cmd(s->rxDMAChannel, ENABLE);
            USART_DMACmd(s->USARTx, USART_DMAReq_Rx, ENABLE);
            s->rxDMAPos = DMA_GetCurrDataCounter(s->rxDMAChannel);
#endif
        } else {
            USART_ClearITPendingBit(s->USARTx, USART_IT_RXNE);
            USART_ITConfig(s->USARTx, USART_IT_RXNE, ENABLE);
        }
    }

    // Transmit DMA or IRQ
    if (mode & MODE_TX) {
#ifdef STM32F4
        if (s->txDMAStream) {
            DMA_StructInit(&DMA_InitStructure);
            DMA_InitStructure.DMA_PeripheralBaseAddr = s->txDMAPeripheralBaseAddr;
            DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
            DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
            DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
            DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
            DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
            DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable ;
            DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull ;
            DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single ;
            DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
#else
        if (s->txDMAChannel) {
            DMA_StructInit(&DMA_InitStructure);
            DMA_InitStructure.DMA_PeripheralBaseAddr = s->txDMAPeripheralBaseAddr;
            DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
            DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
            DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
            DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
            DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
            DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
#endif
            DMA_InitStructure.DMA_BufferSize = s->port.txBufferSize;

#ifdef STM32F4
            DMA_InitStructure.DMA_Channel = s->txDMAChannel;
            DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
            DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
            DMA_DeInit(s->txDMAStream);
            DMA_Init(s->txDMAStream, &DMA_InitStructure);
            DMA_ITConfig(s->txDMAStream, DMA_IT_TC | DMA_IT_FE | DMA_IT_TE | DMA_IT_DME, ENABLE);
            DMA_SetCurrDataCounter(s->txDMAStream, 0);
#else
            DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
            DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
            DMA_DeInit(s->txDMAChannel);
            DMA_Init(s->txDMAChannel, &DMA_InitStructure);
            DMA_ITConfig(s->txDMAChannel, DMA_IT_TC, ENABLE);
            DMA_SetCurrDataCounter(s->txDMAChannel, 0);
            s->txDMAChannel->CNDTR = 0;
#endif
            USART_DMACmd(s->USARTx, USART_DMAReq_Tx, ENABLE);
        } else {
            USART_ITConfig(s->USARTx, USART_IT_TXE, ENABLE);
        }
    }

    USART_Cmd(s->USARTx, ENABLE);
#endif

    return (serialPort_t *)s;
}
